let nameMap = {"HS1":"首站换执站1","H1":"六中换热站","H2":"金华苑换热站","H3":"御龙湾换热站","H4":"闫冀堡树换热站","H5":"棚户区B区换热站","H6":"棚户区一期(沉陷区)换热站","H7":"安逸村换热站","H8":"梁吉村换热站","H9":"绿都二期换热站","H10":"梁吉村东换热站","H11":"李家堡换热站(纬四路)","H12":"赵家堡村换热站","H13":"李家堡村换热站(纬三路)","H14":"残联换热站","H15":"韩屯村南换热站","H16":"韩屯村北换热站","H17":"亚泰苑换热站","H18":"会计事务所换热站","H19":"嘉禾园换热站","H20":"安居苑换热站","H21":"安泰换热站","H22":"安康嘉园换热站","H23":"上站村换热站","H24":"顺康换热站","H25":"公安局换热站","H26":"蓉和菀换热站","H27":"气象局换热站","H28_H":"嘉欣苑高区换热站","H28_M":"嘉欣苑中区换热站","H28_L":"嘉欣苑低区换热站","H29":"三道河(信河苑)换热站","H30":"新体育场换热站","H31":"宋古换热站","H32":"南张家庄换热站","H33":"宋古村换热站","H34":"宋古驾校换热站","H35":"马女村换热站","H36":"绵山一中换热站","H37":"南靳屯村换热站","H38":"交警队换热站","H39":"后党峪小区换热站","H40":"粮食局直属库换热站","H41":"东南办事处换热站","H42":"定阳路南换热站","H43":"石油公司换热站","H44":"电碳厂（一区）换热站","H45":"石河村换热站","H46":"电杆厂换热站","H47":"朝阳路换热站","H48":"永康换热站","H49":"顺城关换热站","H50":"彦泰换热站","H51":"介休一中换热站","H52":"泓达小区换热站","H53_H":"二中C区（高区）换热站","H53_L":"二中（低区）换热站","H54":"馨苑小区换热站","H55":"邮政局换热站","H56":"盛华丽苑换热站","H57":"人民医院换热站","H58":"环保局换热站","H59":"城健局换热站","H60":"北坛小学换热站","H61":"药材公司换热站","H62":"城关一院换热站","H63":"秀南怡苑换热站","H64":"物资机关换热站","H65":"中仁换热站","H66":"一品天下换热站","H67":"矿务局供应处换热站","H68":"铁亮大厦换热站","H69":"车站二区换热站","H70":"二运换热站","H71":"矿务局医院换热站","H72":"富康苑换热站","H73":"电碳厂换热站(宿舍)","H74":"城隍庙换热站","H75":"南大街换热站","H76":"党校换热站","H77":"体委换热站","H78":"中行换热站","H79":"矿务局(汾矿)机关换热站","H80":"矿务局技校换热站","H81":"农发行换热站","H82":"景泰换热站","H83":"水泵厂换热站","H84":"无机盐厂换热站","H85_H":"棚户区二期高区换热站","H85_L":"棚户区二期低区换热站","H86":"消防队换热站","H87_H":"绵山墅高区换热站","H87_L":"绵山墅低区换热站","H88":"纸厂换热站","H89":"汾矿换热站","H90":"北村东换热站","H91":"北村西换热站","H92":"小宋曲换热站","H93":"钦屯小区换热站","H94":"滨河小区换热站","H95":"东内封换热站","H96":"西内封换热站","H97":"上城南村换热站","H98":"机务站换热站","H99":"洗煤厂换热站","H100":"种羊场换热站","H101":"东段屯换热站","H102":"宋安屯换热站","H103":"洪善换热站","H104":"西段屯换热站","H105":"康和小区换热站","H106":"韩屯村东换热站","H107":"岳家湾换热站","H108":"祥和嘉园换热站","H109":"西靳屯换热站"}

let str = "INSERT INTO regulate_config VALUES (\"10\",\"H12_enable_switch\",'{\n" +
  "    \"controlInfo\":{\n" +
  "        \"type\":\"control\",\n" +
  "        \"fields\":[\n" +
  "            {\n" +
  "                \"type\":\"composite\",\n" +
  "                \"property\":\"H12_enable\",\n" +
  "                \"variable\":\"jiexiu_smart_valve:73f8c3734cb34e73-e700c79087ce9cfa:Toolkit:Derive:H12_enable\",\n" +
  "                \"label\":\"智能AI控制\",\n" +
  "                \"unit\":null,\n" +
  "                \"showType\":\"RADIO\",\n" +
  "                \"catalog\":{\n" +
  "                    \"1\":\"开启\",\n" +
  "                    \"0\":\"关闭\"\n" +
  "                },\n" +
  "                \"categories\":{\n" +
  "\n" +
  "                }\n" +
  "            }\n" +
  "        ],\n" +
  "        \"target\":\"jiexiu_smart_valve\",\n" +
  "        \"scope\":\"smart-edge\",\n" +
  "        \"controlProperties\":[\n" +
  "            {\n" +
  "                \"property\":\"H12_enable\"\n" +
  "            }\n" +
  "        ]\n" +
  "    },\n" +
  "    \"abnormalValidators\":[\n" +
  "    ]\n" +
  "}')"

let res=[]
let id = 11
for(let i in nameMap) {
  res.push("\nINSERT INTO regulate_config VALUES (\""+(id++)+"\",\""+i+"_enable_switch\",'{\n" +
    "    \"controlInfo\":{\n" +
    "        \"type\":\"control\",\n" +
    "        \"fields\":[\n" +
    "            {\n" +
    "                \"type\":\"composite\",\n" +
    "                \"property\":\""+i+"_enable\",\n" +
    "                \"variable\":\"jiexiu_smart_valve:73f8c3734cb34e73-e700c79087ce9cfa:Toolkit:Derive:"+i+"_enable\",\n" +
    "                \"label\":\"智能AI控制\",\n" +
    "                \"unit\":null,\n" +
    "                \"showType\":\"RADIO\",\n" +
    "                \"catalog\":{\n" +
    "                    \"1\":\"开启\",\n" +
    "                    \"0\":\"关闭\"\n" +
    "                },\n" +
    "                \"categories\":{\n" +
    "\n" +
    "                }\n" +
    "            }\n" +
    "        ],\n" +
    "        \"target\":\"jiexiu_smart_valve\",\n" +
    "        \"scope\":\"smart-edge\",\n" +
    "        \"controlProperties\":[\n" +
    "            {\n" +
    "                \"property\":\""+i+"_enable\"\n" +
    "            }\n" +
    "        ]\n" +
    "    },\n" +
    "    \"abnormalValidators\":[\n" +
    "    ]\n" +
    "}')")
}

console.log(res.join(";"))
